In [1]:
import pandas as pd

In [ ]:
Q1. Create a Pandas Series that contains the following data: 4, 8, 15, 16, 23, and 42. Then, print the series.

In [3]:
z=pd.Series([4, 8, 15, 16, 23,42])
print(z)

0     4
1     8
2    15
3    16
4    23
5    42
dtype: int64

In [ ]:
Q2. Create a variable of list type containing 10 elements in it, and apply pandas.Series function on the
variable print it.

In [5]:
l = [1,2,3,4,5,6,7,8,9,10] 
print(pd.Series(l))

0     1
1     2
2     3
3     4
4     5
5     6
6     7
7     8
8     9
9    10
dtype: int64

In [ ]:
Q3. Create a Pandas DataFrame that contains the following data:

In [8]:
df = pd.DataFrame({'Name':['Alice','Bob','Claire'],'Age':[25,30,27],'Gender':['Female','Male','Female']})

In [9]:
df

     Name  Age  Gender
0   Alice   25  Female
1     Bob   30    Male
2  Claire   27  Female

In [ ]:
Q4. What is ‘DataFrame’ in pandas and how is it different from pandas.series? Explain with an example.

Key Differences:
Dimension: A Series is 1-dimensional (single column or row), whereas a DataFrame is 2-dimensional (rows and columns).
Indexing: A Series has only one set of labels for indexing, while a DataFrame has both row and column labels.

In [ ]:
Q5. What are some common functions you can use to manipulate data in a Pandas DataFrame? Can
you give an example of when you might use one of these functions?

In [19]:
df = pd.DataFrame({'Name':['Alice','Bob','Claire'],'Age':[25,30,27],'Gender':['Female','Male','Female']})

In [21]:
df.head(1)

    Name  Age  Gender
0  Alice   25  Female

In [22]:
df.describe()

             Age
count   3.000000
mean   27.333333
std     2.516611
min    25.000000
25%    26.000000
50%    27.000000
75%    28.500000
max    30.000000

In [ ]:
Q6. Which of the following is mutable in nature Series, DataFrame, Panel?

In [ ]:
Q7. Create a DataFrame using multiple Series. Explain with an example.

In [11]:
series1 = pd.Series([1,2,3,4,5,6,7])
series2 = pd.Series(['sarisht','shreshth','test','user','pikachu','deadpool','batman'])

In [18]:
pd.DataFrame([series1,series2])

         0         1     2     3        4         5       6
0        1         2     3     4        5         6       7
1  sarisht  shreshth  test  user  pikachu  deadpool  batman